
numbers = [5, 2, 9, 1, 7, 3]

# len() -- აბრუნებს სიის სიგრძეს
print(len(numbers))  # გამოტანს ელემენტების რაოდენობას -> 6

# sum() -- აბრუნებს ყველა ელემენტის ჯამს
print(sum(numbers))  # გამოთვლის და გამოიტანს 27

# min() -- აბრუნებს სიაში ყველაზე პატარა ელემენტს
print(min(numbers))  # გამოიტანს 1

# max() -- აბრუნებს სიაში ყველაზე დიდ ელემენტს
print(max(numbers))  # გამოიტანს 9

# .append() -- ამატებს ახალ ელემენტს სიის ბოლოში
numbers.append(4)
print(numbers)  # ახლა იქნება [5, 2, 9, 1, 7, 3, 4]

# .sort() -- ალაგებს სიას ზრდადობით
numbers.sort
print(numbers)  # იქნება [1, 2, 3, 4, 5, 7, 9]

# .reverse() -- აბრუნებს სიას უკუღმა
numbers.reverse()
print(numbers)  # იქნება [9, 7, 5, 4, 3, 2, 1]

# .remove() -- სიიდან შლის მითითებულ ელემენტს
numbers.remove(4)
print(numbers)  # 4 გაქრება, დარჩება [9, 7, 5, 3, 2, 1]
