# print():
# + ადვილად გამოვაქვს ინფორმაცია ეკრანზე (დასაბეჭდი შედეგი ტერმინალში ჩანს)
# + კარგია დროებითი ტესტირებისთვის და დებაგინგისთვის
# - ვერ ვიყენებთ გამოთვლებში რადგან print უბრალოდ ბეჭდავს და შედეგს არ აბრუნებს
# - სხვა ფუნქციებში ან ცვლადებში მისი შედეგი გამოყენებადი არ არის

# return:
# + აბრუნებს მნიშვნელობას ფუნქციიდან რაც შეიძლება გამოყენებულ იქნას სხვა გამოთვლებში
# + საშუალებას გვაძლევს ფუნქციის შედეგი შევინახოთ ცვლადში და გამოვიყენოთ მრავალჯერ
# - არ ბეჭდავს ეკრანზე თუ პირდაპირ არ გამოვიძახეთ print()
# - ახალბედებისთვის ხანდახან დამაბნეველია რადგან შედეგი "ჩუმად" აბრუნდება